#ifndef __SR_NFC_H_
#define __SR_NFC_H_

//数据头
/*************************************************************************/
#define HEADER    0x02
/*************************************************************************/


//字节转换宏定义
/*************************************************************************/
#define SWAP16(X)  (((X & 0XFF00) >> 8) | ((X & 0XFF) << 8))
#define SWAP32(X)  ((X & 0XFF) << 24 | (X & 0XFF00) << 8 | (X & 0XFF0000) >> 8 | (X >> 24) & 0XFF)
/*************************************************************************/

//重定义数据类型名
/*************************************************************************/
typedef unsigned char      u8;
typedef unsigned short int u16;
typedef short int          s16;
typedef int                s32;
typedef signed long long   s64;
/*************************************************************************/
#pragma pack(1)

//上位机接收NFC上报数据
/*************************************************************************/
union RxNfcData
{
   u8 data[4];
   struct
   {
      u8   Header;           //数据头
      u8   Number;           //坐标编号
      u8   Retain;           //保留位
      u8   Check;            //校验位
   }prot;
}RXNfcData;
/*************************************************************************/

//上位机发送给NFC的数据
/*************************************************************************/
union TxNfcData
{
   u8 data[4];
   struct
   {
      u8   Header;           //数据头
      u8   Voltage;          //电量
      u8   Retain;           //保留位
      u8   Check;            //校验位
   }prot;
}TXNfcData;
/*************************************************************************/
#pragma pack(4)
#endif
